<a href="https://colab.research.google.com/github/VivXwan/PepDSNotes/blob/main/Pandas/Assignment_First_Try.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**import pandas as pd and numpy as np**

In [1]:
import numpy as np
import pandas as pd

read csv from this url https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv using pandas in df variable.


If any error is printed ignore that.

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv")

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2882: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

**check the head of DataFrame**

In [4]:
head = df.head()

In [5]:
head

   Id       EmployeeName  ...         Agency Status
0   1     NATHANIEL FORD  ...  San Francisco    NaN
1   2       GARY JIMENEZ  ...  San Francisco    NaN
2   3     ALBERT PARDINI  ...  San Francisco    NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco    NaN
4   5    PATRICK GARDNER  ...  San Francisco    NaN

[5 rows x 13 columns]

**use the info method to find out how many entries there are.**

In [8]:
info = df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

BasePay and OvertimePay both the fields are of **object** type and contains **missing data**, convert them to numeric using

 `pd.to_numeric(df[column_name], errors='coerce')`

 then check datatype using info function

In [17]:
df['BasePay'] = pd.to_numeric(df['BasePay'],errors = 'coerce')
df['OvertimePay'] = pd.to_numeric(df['OvertimePay'],errors = 'coerce')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(5), int64(2), object(6)
memory usage: 14.7+ MB

**What is the average BasePay?**

In [23]:
avg = df['BasePay'].mean()

In [24]:
avg

66325.44884050643

**What is the highest amount of OvertimePay in the dataset?**

In [25]:
maxOP = df['OvertimePay'].max()

In [26]:
maxOP

245131.88

**What is the Job Title of JOSEPH DRISCOLL?**

In [27]:
JTforJD = df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

In [28]:
JTforJD

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**How much does JOSEPH DRISCOLL make (including benefits)**

In [33]:
TPwB = df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

In [35]:
TPwB

24    270324.91
Name: TotalPayBenefits, dtype: float64

**What is the name of highest paid person**

In [38]:
maxPay = df['TotalPayBenefits'].max()

In [39]:
df[df['TotalPayBenefits']==maxPay]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

:**What is the name of lowest paid person (including benefits)?**

In [50]:
minPay = df['TotalPayBenefits'].min()
print(np.where(df['TotalPayBenefits']==minPay)[0][0])

148653

In [51]:
index = np.where(df['TotalPayBenefits']==minPay)[0][0]
df.iloc[index]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                    0.0
OvertimePay                                0.0
OtherPay                               -618.13
Benefits                                  0.00
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

*drop* the column with **0 non-null** value, then print info

In [52]:
df.dropna(axis = 'columns',how = 'all', inplace = True)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(6)
memory usage: 13.6+ MB

**What was the average (mean) BasePay of all employees per year?(2011, 2014)**

In [58]:
avgMeanBasePay = df[df['Year']<=2014][df['Year']>=2011].groupby('Year')['BasePay'].mean().reset_index()

In [59]:
avgMeanBasePay

   Year       BasePay
0  2011  63595.956517
1  2012  65436.406857
2  2013  69630.030216
3  2014  66564.421924

**How many unique job titles are there**

In [67]:
unique1 = df['JobTitle'].unique().size
unique2 = df['JobTitle'].nunique()

In [68]:
print(unique1,unique2,sep='\n')

2159
2159

**What are the top 5 most common jobs?**

In [71]:
top5Jobs = df['JobTitle'].value_counts().head()

In [72]:
top5Jobs

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

**JobTitles with only one occurence in 2013?**

**`Answer Provided has some difference, Need to check why. Pretty confident that mine is not wrong.`**

In [101]:
minval = np.where(df['JobTitle'].value_counts()==df['JobTitle'].value_counts().min(),1,0).sum()
arr = df['JobTitle'].value_counts()
minval2 = arr[arr == arr.min()].size

In [102]:
print(minval,minval2,sep="\n")

239
239

**How many people has word chief in there jobtitle?**

**`Difference in answers: Because the latter splits 'JobTitle' at spaces and then checks for the word 'Chief' which doesnt match with 'Chief,' which is the case in a lots of JobTitles, eg. Rows 7,8.
Check with `**

**`df.loc[df['JobTitle'].str.contains('Chief',case = False)]['JobTitle']`**

In [113]:
df.loc[df['JobTitle'].str.contains('Chief',case = False)]['JobTitle'].size

627

In [112]:
df['JobTitle'].apply(lambda x: 'chief' in x.lower().split(' ')).sum()

477

**Find correlation of TotalPay with other fields**

**`A minor difference in both the answers. Find the reason.`**

In [106]:
df.corr().loc['TotalPay']

Id                 -0.211478
BasePay             0.954494
OvertimePay         0.504859
TotalPay            1.000000
TotalPayBenefits    0.977313
Year                0.032090
Name: TotalPay, dtype: float64

Id                 -0.211478
BasePay             0.954494
OvertimePay         0.504859
Benefits            0.632202
TotalPay            1.000000
TotalPayBenefits    0.977313
Year                0.032090
Notes                    NaN
Name: TotalPay, dtype: float64

**use np.where and replace 'Not Provided' on Benefit column to `np.nan`, then fill all this nan value with 0**

In [123]:
df['Benefits'] = np.where(df['Benefits']=='Not Provided',np.nan,df['Benefits'])
df['Benefits'].fillna(0,inplace = True)

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          148654 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(6)
memory usage: 13.6+ MB

**Now convert Benefit column to numeric type**

In [125]:
df['Benefits'] = pd.to_numeric(df['Benefits'])

In [126]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          148654 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(5), int64(2), object(5)
memory usage: 13.6+ MB